sparta_article_manager/app/controllers/articles_controller.rb

def create
  @article = Article.new(article_params)
  if @article.save
---
INSERT INTO "articles" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", 2017-03-28 23:38:01 UTC], ["updated_at", 2017-03-28 23:38:01 UTC]]