sparta_article_manager/app/controllers/pictures_controller.rb

SELECT "pictures".* FROM "pictures"
---
  def index
    # load all the article pictures
    @pictures = Picture.all

SELECT  "pictures".* FROM "pictures" WHERE "pictures"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
---
  def show
    # show all the article pictures
    @picture = Picture.find params[:id]